In [1]:
import numpy as np
import pandas as pd

In [3]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [5]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
27.1 ms ± 320 μs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
595 μs ± 33.8 μs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [11]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [13]:
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

In [15]:
1 + np.nan

nan

In [17]:
0 * np.nan

nan

In [19]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [21]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [23]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [25]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [27]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [33]:
data = pd.Series([1, np.nan, 'hello', None])

In [35]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [37]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [39]:
data.dropna()

0        1
2    hello
dtype: object

In [41]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [43]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [65]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [67]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [86]:
df.dropna(axis='columns',how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [71]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [73]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [75]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [88]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [94]:
# forward-fill
df.ffill(axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [79]:
# back-fill
df.bfill(axis=1)

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN